<?xml version="1.0" ?>
<net batch="1" name="tf_model" version="6">
	<layers>
		<layer id="0" name="conv2d_1_input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul1_" precision="FP32" type="Power">
			<data power="1" scale="0.00392156862745098" shift="0"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="3456"/>
			</blobs>
		</layer>
		<layer id="3" name="ScaleShift/conv2d_1/BiasAdd/Add" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3456" size="128"/>
				<biases offset="3584" size="128"/>
			</blobs>
		</layer>
		<layer id="4" name="activation_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Mul1_1156/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3712" size="128"/>
				<biases offset="3840" size="128"/>
			</blobs>
		</layer>
		<layer id="6" name="Mul2_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3968" size="128"/>
				<biases offset="4096" size="128"/>
			</blobs>
		</layer>
		<layer id="7" name="max_pooling2d_1/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,3"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2d_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4224" size="73728"/>
			</blobs>
		</layer>
		<layer id="9" name="ScaleShift/conv2d_2/BiasAdd/Add" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="77952" size="256"/>
				<biases offset="78208" size="256"/>
			</blobs>
		</layer>
		<layer id="10" name="activation_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Mul1_1168/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="78464" size="256"/>
				<biases offset="78720" size="256"/>
			</blobs>
		</layer>
		<layer id="12" name="Mul2_1172/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="78976" size="256"/>
				<biases offset="79232" size="256"/>
			</blobs>
		</layer>
		<layer id="13" name="conv2d_3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="79488" size="147456"/>
			</blobs>
		</layer>
		<layer id="14" name="ScaleShift/conv2d_3/BiasAdd/Add" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="77952" size="256"/>
				<biases offset="226944" size="256"/>
			</blobs>
		</layer>
		<layer id="15" name="activation_3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Mul1_1180/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="227200" size="256"/>
				<biases offset="227456" size="256"/>
			</blobs>
		</layer>
		<layer id="17" name="Mul2_1184/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="227712" size="256"/>
				<biases offset="227968" size="256"/>
			</blobs>
		</layer>
		<layer id="18" name="max_pooling2d_2/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv2d_4/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="228224" size="294912"/>
			</blobs>
		</layer>
		<layer id="20" name="ScaleShift/conv2d_4/BiasAdd/Add" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="523136" size="512"/>
				<biases offset="523648" size="512"/>
			</blobs>
		</layer>
		<layer id="21" name="activation_4/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Mul1_1192/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="524160" size="512"/>
				<biases offset="524672" size="512"/>
			</blobs>
		</layer>
		<layer id="23" name="Mul2_1196/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="525184" size="512"/>
				<biases offset="525696" size="512"/>
			</blobs>
		</layer>
		<layer id="24" name="conv2d_5/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="526208" size="589824"/>
			</blobs>
		</layer>
		<layer id="25" name="ScaleShift/conv2d_5/BiasAdd/Add" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="523136" size="512"/>
				<biases offset="1116032" size="512"/>
			</blobs>
		</layer>
		<layer id="26" name="activation_5/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Mul1_1204/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1116544" size="512"/>
				<biases offset="1117056" size="512"/>
			</blobs>
		</layer>
		<layer id="28" name="Mul2_1208/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1117568" size="512"/>
				<biases offset="1118080" size="512"/>
			</blobs>
		</layer>
		<layer id="29" name="max_pooling2d_3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="max_pooling2d_3/MaxPool/Transpose" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="flatten_1/stack/Concat_/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1118592" size="8"/>
			</blobs>
		</layer>
		<layer id="32" name="flatten_1/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="dense_1/MatMul" precision="FP32" type="FullyConnected">
			<data out-size="1024"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1118600" size="33554432"/>
			</blobs>
		</layer>
		<layer id="34" name="ScaleShift/dense_1/BiasAdd/Add" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34673032" size="4096"/>
				<biases offset="34677128" size="4096"/>
			</blobs>
		</layer>
		<layer id="35" name="activation_6/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="batch_normalization_6/batchnorm_1/mul_1/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34681224" size="4096"/>
				<biases offset="34685320" size="4096"/>
			</blobs>
		</layer>
		<layer id="37" name="dense_2/MatMul" precision="FP32" type="FullyConnected">
			<data out-size="2"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34689416" size="8192"/>
			</blobs>
		</layer>
		<layer id="38" name="ScaleShift/dense_2/BiasAdd/Add" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34697608" size="8"/>
				<biases offset="34697616" size="8"/>
			</blobs>
		</layer>
		<layer id="39" name="activation_7/Sigmoid" precision="FP32" type="Activation">
			<data type="sigmoid"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="2" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="3" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="3" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="3" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="3" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="3" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="3" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="3" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="3" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="3" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="3" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="36" from-port="3" to-layer="37" to-port="0"/>
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="3" to-layer="39" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-408-gac8584cb7"/>
		<cli_parameters>
			<batch value="64"/>
			<blobs_as_inputs value="False"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP32"/>
			<disable_fusing value="True"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR\tf_model.pb"/>
			<input_model_is_text value="False"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale value="255.0"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="counts, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_checkpoint, input_meta_graph, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, model_name, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_dir, saved_model_tags, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
