<?xml version="1.0" ?>
<net batch="1" name="tf_classification_model" version="6">
	<layers>
		<layer id="0" name="inception_v3_input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="inception_v3/conv2d_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="3456"/>
				<biases offset="3456" size="128"/>
			</blobs>
		</layer>
		<layer id="2" name="inception_v3/activation_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="inception_v3/conv2d_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3584" size="36864"/>
				<biases offset="40448" size="128"/>
			</blobs>
		</layer>
		<layer id="4" name="inception_v3/activation_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="inception_v3/conv2d_3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
			<blobs>
				<weights offset="40576" size="73728"/>
				<biases offset="114304" size="256"/>
			</blobs>
		</layer>
		<layer id="6" name="inception_v3/activation_3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="inception_v3/max_pooling2d_1/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="inception_v3/conv2d_4/convolution" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="80" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
			<blobs>
				<weights offset="114560" size="20480"/>
				<biases offset="135040" size="320"/>
			</blobs>
		</layer>
		<layer id="9" name="inception_v3/activation_4/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="inception_v3/conv2d_5/convolution" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
			<blobs>
				<weights offset="135360" size="552960"/>
				<biases offset="688320" size="768"/>
			</blobs>
		</layer>
		<layer id="11" name="inception_v3/activation_5/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="inception_v3/max_pooling2d_2/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="inception_v3/conv2d_6/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="689088" size="49152"/>
				<biases offset="738240" size="256"/>
			</blobs>
		</layer>
		<layer id="14" name="inception_v3/activation_6/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="inception_v3/conv2d_7/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="738496" size="36864"/>
				<biases offset="775360" size="192"/>
			</blobs>
		</layer>
		<layer id="16" name="inception_v3/activation_7/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="inception_v3/conv2d_8/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="64" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="775552" size="307200"/>
				<biases offset="1082752" size="256"/>
			</blobs>
		</layer>
		<layer id="18" name="inception_v3/activation_8/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="inception_v3/conv2d_9/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1083008" size="49152"/>
				<biases offset="1132160" size="256"/>
			</blobs>
		</layer>
		<layer id="20" name="inception_v3/activation_9/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="inception_v3/conv2d_10/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1132416" size="221184"/>
				<biases offset="1353600" size="384"/>
			</blobs>
		</layer>
		<layer id="22" name="inception_v3/activation_10/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="inception_v3/conv2d_11/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1353984" size="331776"/>
				<biases offset="1685760" size="384"/>
			</blobs>
		</layer>
		<layer id="24" name="inception_v3/activation_11/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="inception_v3/average_pooling2d_1/AvgPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="inception_v3/conv2d_12/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1686144" size="24576"/>
				<biases offset="1710720" size="128"/>
			</blobs>
		</layer>
		<layer id="27" name="inception_v3/activation_12/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="inception_v3/mixed0/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>32</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="inception_v3/conv2d_13/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1710848" size="65536"/>
				<biases offset="1776384" size="256"/>
			</blobs>
		</layer>
		<layer id="30" name="inception_v3/activation_13/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="inception_v3/conv2d_14/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1776640" size="49152"/>
				<biases offset="1825792" size="192"/>
			</blobs>
		</layer>
		<layer id="32" name="inception_v3/activation_14/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="inception_v3/conv2d_15/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="64" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1825984" size="307200"/>
				<biases offset="2133184" size="256"/>
			</blobs>
		</layer>
		<layer id="34" name="inception_v3/activation_15/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="inception_v3/conv2d_16/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2133440" size="65536"/>
				<biases offset="2198976" size="256"/>
			</blobs>
		</layer>
		<layer id="36" name="inception_v3/activation_16/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="inception_v3/conv2d_17/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2199232" size="221184"/>
				<biases offset="2420416" size="384"/>
			</blobs>
		</layer>
		<layer id="38" name="inception_v3/activation_17/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="inception_v3/conv2d_18/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2420800" size="331776"/>
				<biases offset="2752576" size="384"/>
			</blobs>
		</layer>
		<layer id="40" name="inception_v3/activation_18/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="inception_v3/average_pooling2d_2/AvgPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="inception_v3/conv2d_19/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2752960" size="65536"/>
				<biases offset="2818496" size="256"/>
			</blobs>
		</layer>
		<layer id="43" name="inception_v3/activation_19/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="inception_v3/mixed1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="inception_v3/conv2d_20/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2818752" size="73728"/>
				<biases offset="2892480" size="256"/>
			</blobs>
		</layer>
		<layer id="46" name="inception_v3/activation_20/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="inception_v3/conv2d_21/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2892736" size="55296"/>
				<biases offset="2948032" size="192"/>
			</blobs>
		</layer>
		<layer id="48" name="inception_v3/activation_21/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="inception_v3/conv2d_22/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="64" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2948224" size="307200"/>
				<biases offset="3255424" size="256"/>
			</blobs>
		</layer>
		<layer id="50" name="inception_v3/activation_22/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="inception_v3/conv2d_23/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3255680" size="73728"/>
				<biases offset="3329408" size="256"/>
			</blobs>
		</layer>
		<layer id="52" name="inception_v3/activation_23/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="inception_v3/conv2d_24/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3329664" size="221184"/>
				<biases offset="3550848" size="384"/>
			</blobs>
		</layer>
		<layer id="54" name="inception_v3/activation_24/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="inception_v3/conv2d_25/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3551232" size="331776"/>
				<biases offset="3883008" size="384"/>
			</blobs>
		</layer>
		<layer id="56" name="inception_v3/activation_25/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="inception_v3/average_pooling2d_3/AvgPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="inception_v3/conv2d_26/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3883392" size="73728"/>
				<biases offset="3957120" size="256"/>
			</blobs>
		</layer>
		<layer id="59" name="inception_v3/activation_26/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="inception_v3/mixed2/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="inception_v3/conv2d_27/convolution" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="384" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>384</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3957376" size="3981312"/>
				<biases offset="7938688" size="1536"/>
			</blobs>
		</layer>
		<layer id="62" name="inception_v3/activation_27/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>384</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>384</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="inception_v3/conv2d_28/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7940224" size="73728"/>
				<biases offset="8013952" size="256"/>
			</blobs>
		</layer>
		<layer id="64" name="inception_v3/activation_28/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="inception_v3/conv2d_29/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8014208" size="221184"/>
				<biases offset="8235392" size="384"/>
			</blobs>
		</layer>
		<layer id="66" name="inception_v3/activation_29/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="inception_v3/conv2d_30/convolution" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8235776" size="331776"/>
				<biases offset="8567552" size="384"/>
			</blobs>
		</layer>
		<layer id="68" name="inception_v3/activation_30/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="inception_v3/max_pooling2d_3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>288</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>288</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="inception_v3/mixed3/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>384</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>288</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="inception_v3/conv2d_31/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8567936" size="589824"/>
				<biases offset="9157760" size="768"/>
			</blobs>
		</layer>
		<layer id="72" name="inception_v3/activation_31/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="inception_v3/conv2d_32/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9158528" size="393216"/>
				<biases offset="9551744" size="512"/>
			</blobs>
		</layer>
		<layer id="74" name="inception_v3/activation_32/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="inception_v3/conv2d_33/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,7" output="128" pads_begin="0,3" pads_end="0,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9552256" size="458752"/>
				<biases offset="10011008" size="512"/>
			</blobs>
		</layer>
		<layer id="76" name="inception_v3/activation_33/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="inception_v3/conv2d_34/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,1" output="192" pads_begin="3,0" pads_end="3,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10011520" size="688128"/>
				<biases offset="10699648" size="768"/>
			</blobs>
		</layer>
		<layer id="78" name="inception_v3/activation_34/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="inception_v3/conv2d_35/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10700416" size="393216"/>
				<biases offset="11093632" size="512"/>
			</blobs>
		</layer>
		<layer id="80" name="inception_v3/activation_35/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="inception_v3/conv2d_36/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,1" output="128" pads_begin="3,0" pads_end="3,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11094144" size="458752"/>
				<biases offset="11552896" size="512"/>
			</blobs>
		</layer>
		<layer id="82" name="inception_v3/activation_36/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="inception_v3/conv2d_37/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,7" output="128" pads_begin="0,3" pads_end="0,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11553408" size="458752"/>
				<biases offset="12012160" size="512"/>
			</blobs>
		</layer>
		<layer id="84" name="inception_v3/activation_37/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="inception_v3/conv2d_38/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,1" output="128" pads_begin="3,0" pads_end="3,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12012672" size="458752"/>
				<biases offset="12471424" size="512"/>
			</blobs>
		</layer>
		<layer id="86" name="inception_v3/activation_38/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="inception_v3/conv2d_39/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,7" output="192" pads_begin="0,3" pads_end="0,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12471936" size="688128"/>
				<biases offset="13160064" size="768"/>
			</blobs>
		</layer>
		<layer id="88" name="inception_v3/activation_39/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="inception_v3/average_pooling2d_4/AvgPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="inception_v3/conv2d_40/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13160832" size="589824"/>
				<biases offset="13750656" size="768"/>
			</blobs>
		</layer>
		<layer id="91" name="inception_v3/activation_40/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="inception_v3/mixed4/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="inception_v3/conv2d_41/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13751424" size="589824"/>
				<biases offset="14341248" size="768"/>
			</blobs>
		</layer>
		<layer id="94" name="inception_v3/activation_41/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="inception_v3/conv2d_42/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="160" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14342016" size="491520"/>
				<biases offset="14833536" size="640"/>
			</blobs>
		</layer>
		<layer id="96" name="inception_v3/activation_42/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="inception_v3/conv2d_43/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,7" output="160" pads_begin="0,3" pads_end="0,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14834176" size="716800"/>
				<biases offset="15550976" size="640"/>
			</blobs>
		</layer>
		<layer id="98" name="inception_v3/activation_43/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="inception_v3/conv2d_44/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,1" output="192" pads_begin="3,0" pads_end="3,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>160</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15551616" size="860160"/>
				<biases offset="16411776" size="768"/>
			</blobs>
		</layer>
		<layer id="100" name="inception_v3/activation_44/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="inception_v3/conv2d_45/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="160" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>768</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
